In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv("../data/titanic.csv")
print(titanic)

In [ ]:
titanic.head(8)

In [ ]:
titanic.dtypes
print(titanic.dtypes)

In [ ]:
ages = titanic["Age"]
ages.head()

In [ ]:
type(titanic["Age"])
titanic["Age"].shape

In [ ]:
age_sex = titanic[["Age", "Sex"]]
print(type(age_sex))
titanic[["Age", "Sex"]].shape

In [ ]:
above_35 = titanic[titanic["Age"] > 35]
above_35.head()

In [ ]:
print(titanic["Age"] > 35)
above_35.shape

In [50]:
class_23 = titanic[titanic["Pclass"].isin([2, 3])]
class_23.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S